def area(a):
    """Принимает сторону a квадрата, возвращает площадь квадрата.

    Параметры:
    a (int, float): сторона квадрата 

    Возвращает:
    int, float: площадь квадрата со стороной a

    Пример использования:
    >>> area(10)
    100
    """
    return a * a

def perimeter(a):
    """Принимает сторону а квадрата, возвращает периметр квадрата.

    Параметры:
    a (int, float): сторона квадрата 

    Возвращает:
    int, float: периметр квадрата

    Пример использования:
    >>> perimeter(10)
    40
    """
    return 4 * a
